Hmmmm, lots of destroyed/recreated stuff in the output of `terraform plan`.

<details> <summary>terraform plan output</summary>

```bash
$ terraform plan -var-file=projects/pangeo-hubs.tfvars
module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0]: Refreshing state... [id=8865553039709359568]
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=owc3]
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
google_artifact_registry_repository.container_repository: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1/repositories/]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=two-eye-two-see/roles/monitoring.metricWriter/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_member.project: Refreshing state... [id=two-eye-two-see/roles/artifactregistry.reader/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com]
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/two-eye-two-see/serviceAccounts/tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.project-roles[0]: Refreshing state... [id=two-eye-two-see/roles/container.admin/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=two-eye-two-see/roles/logging.logWriter/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.project-roles[2]: Refreshing state... [id=two-eye-two-see/roles/compute.instanceAdmin.v1/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com]
module.service_accounts.google_service_account.service_accounts[0]: Refreshing state... [id=projects/two-eye-two-see/serviceAccounts/low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com]
module.service_accounts.google_service_account_key.keys[0]: Refreshing state... [id=projects/two-eye-two-see/serviceAccounts/low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com/keys/107710688b17ce563c639416dbc445ee4998ae53]
module.gke.google_container_node_pool.pools["core-pool"]: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/core-pool]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster]
module.service_accounts.google_project_iam_member.project-roles[1]: Refreshing state... [id=two-eye-two-see/roles/artifactregistry.writer/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=two-eye-two-see/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com]
module.gke.google_container_node_pool.pools["dask-worker-pool"]: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/dask-worker-pool]
module.gke.google_container_node_pool.pools["user-pool"]: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/user-pool]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=two-eye-two-see/roles/monitoring.viewer/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] has been changed
  ~ resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] has been changed
  ~ resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/monitoring.metricWriter/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.gke.google_container_cluster.primary has been changed
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster"
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-low-touch-hubs-cluster-core-pool-1732ad61-grp",
            "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-low-touch-hubs-c-dask-worker-pool-75041171-grp",
            "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-low-touch-hubs-cluster-user-pool-a058edeb-grp",
          + "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-low-touch-hubs-cluster-core-pool-6000292e-grp",
        ]
      ~ master_version              = "1.19.9-gke.1400" -> "1.19.9-gke.1900"
        name                        = "low-touch-hubs-cluster"
        # (25 unchanged attributes hidden)









      ~ node_config {
          ~ disk_size_gb      = 50 -> 100
          ~ disk_type         = "pd-standard" -> "pd-ssd"
          ~ labels            = {
              - "default-node-pool"            = "true" -> null
              - "hub.jupyter.org/node-purpose" = "core" -> null
              ~ "hub.jupyter.org/pool-name"    = "core-pool" -> "dask-worker-pool"
              ~ "k8s.dask.org/node-purpose"    = "core" -> "worker"
              ~ "node_pool"                    = "core-pool" -> "dask-worker-pool"
                # (1 unchanged element hidden)
            }
          ~ machine_type      = "e2-highcpu-4" -> "e2-highmem-2"
          ~ metadata          = {
              ~ "node_pool"                = "core-pool" -> "dask-worker-pool"
                # (2 unchanged elements hidden)
            }
          ~ preemptible       = false -> true
          ~ tags              = [
                "gke-low-touch-hubs-cluster",
              - "gke-low-touch-hubs-cluster-core-pool",
              + "gke-low-touch-hubs-cluster-dask-worker-pool",
            ]
          ~ taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "k8s.dask.org_dedicated"
                  + value  = "worker"
                },
            ]
            # (5 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }

      ~ node_pool {
          ~ initial_node_count  = 1 -> 0
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-core-pool-1732ad61-grp",
              + "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-c-dask-worker-pool-75041171-grp",
            ]
          ~ name                = "core-pool" -> "dask-worker-pool"
          ~ node_count          = 4 -> 0
            # (3 unchanged attributes hidden)

          ~ autoscaling {
              ~ max_node_count = 5 -> 10
              ~ min_node_count = 1 -> 0
            }


          ~ node_config {
              ~ disk_size_gb      = 50 -> 100
              ~ disk_type         = "pd-standard" -> "pd-ssd"
              ~ labels            = {
                  - "default-node-pool"            = "true" -> null
                  - "hub.jupyter.org/node-purpose" = "core" -> null
                  ~ "hub.jupyter.org/pool-name"    = "core-pool" -> "dask-worker-pool"
                  ~ "k8s.dask.org/node-purpose"    = "core" -> "worker"
                  ~ "node_pool"                    = "core-pool" -> "dask-worker-pool"
                    # (1 unchanged element hidden)
                }
              ~ machine_type      = "e2-highcpu-4" -> "e2-highmem-2"
              ~ metadata          = {
                  ~ "node_pool"                = "core-pool" -> "dask-worker-pool"
                    # (2 unchanged elements hidden)
                }
              ~ preemptible       = false -> true
              ~ tags              = [
                    "gke-low-touch-hubs-cluster",
                  - "gke-low-touch-hubs-cluster-core-pool",
                  + "gke-low-touch-hubs-cluster-dask-worker-pool",
                ]
              ~ taint             = [
                  + {
                      + effect = "NO_SCHEDULE"
                      + key    = "k8s.dask.org_dedicated"
                      + value  = "worker"
                    },
                ]
                # (5 unchanged attributes hidden)


                # (2 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ node_pool {
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-c-dask-worker-pool-75041171-grp",
              + "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-user-pool-a058edeb-grp",
            ]
          ~ name                = "dask-worker-pool" -> "user-pool"
            # (5 unchanged attributes hidden)



          ~ node_config {
              ~ labels            = {
                  + "hub.jupyter.org/node-purpose" = "user"
                  ~ "hub.jupyter.org/pool-name"    = "dask-worker-pool" -> "user-pool"
                  ~ "k8s.dask.org/node-purpose"    = "worker" -> "scheduler"
                  ~ "node_pool"                    = "dask-worker-pool" -> "user-pool"
                    # (1 unchanged element hidden)
                }
              ~ machine_type      = "e2-highmem-2" -> "n1-standard-4"
              ~ metadata          = {
                  ~ "node_pool"                = "dask-worker-pool" -> "user-pool"
                    # (2 unchanged elements hidden)
                }
              ~ preemptible       = true -> false
              ~ tags              = [
                    "gke-low-touch-hubs-cluster",
                  - "gke-low-touch-hubs-cluster-dask-worker-pool",
                  + "gke-low-touch-hubs-cluster-user-pool",
                ]
              ~ taint             = [
                  ~ {
                      ~ key    = "k8s.dask.org_dedicated" -> "hub.jupyter.org_dedicated"
                      ~ value  = "worker" -> "user"
                        # (1 unchanged element hidden)
                    },
                ]
                # (7 unchanged attributes hidden)


                # (2 unchanged blocks hidden)
            }

            # (3 unchanged blocks hidden)
        }
      ~ node_pool {
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-user-pool-a058edeb-grp",
              + "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-core-pool-6000292e-grp",
            ]
          ~ name                = "user-pool" -> "core-pool"
            # (5 unchanged attributes hidden)

          ~ autoscaling {
              ~ max_node_count = 10 -> 5
                # (1 unchanged attribute hidden)
            }


          ~ node_config {
              ~ disk_size_gb      = 100 -> 50
              ~ disk_type         = "pd-ssd" -> "pd-standard"
              ~ labels            = {
                  + "default-node-pool"            = "true"
                  ~ "hub.jupyter.org/node-purpose" = "user" -> "core"
                  ~ "hub.jupyter.org/pool-name"    = "user-pool" -> "core-pool"
                  ~ "k8s.dask.org/node-purpose"    = "scheduler" -> "core"
                  ~ "node_pool"                    = "user-pool" -> "core-pool"
                    # (1 unchanged element hidden)
                }
              ~ machine_type      = "n1-standard-4" -> "n1-highmem-4"
              ~ metadata          = {
                  ~ "node_pool"                = "user-pool" -> "core-pool"
                    # (2 unchanged elements hidden)
                }
              ~ tags              = [
                    "gke-low-touch-hubs-cluster",
                  - "gke-low-touch-hubs-cluster-user-pool",
                  + "gke-low-touch-hubs-cluster-core-pool",
                ]
              ~ taint             = [
                  - {
                      - effect = "NO_SCHEDULE"
                      - key    = "hub.jupyter.org_dedicated"
                      - value  = "user"
                    },
                ]
                # (6 unchanged attributes hidden)


                # (2 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }




        # (12 unchanged blocks hidden)
    }
  # module.gke.google_project_iam_member.cluster_service_account-log_writer[0] has been changed
  ~ resource "google_project_iam_member" "cluster_service_account-log_writer" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/logging.logWriter/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.gke.google_container_node_pool.pools["core-pool"] has been changed
  ~ resource "google_container_node_pool" "pools" {
        id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/core-pool"
      ~ initial_node_count  = 1 -> 0
        name                = "core-pool"
      ~ node_count          = 1 -> 0
        # (7 unchanged attributes hidden)

      ~ autoscaling {
          ~ min_node_count = 1 -> 0
            # (1 unchanged attribute hidden)
        }




        # (4 unchanged blocks hidden)
    }
  # module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] has been changed
  ~ resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/monitoring.viewer/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.service_accounts.google_project_iam_member.project-roles[0] has been changed
  ~ resource "google_project_iam_member" "project-roles" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/container.admin/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.service_accounts.google_project_iam_member.project-roles[1] has been changed
  ~ resource "google_project_iam_member" "project-roles" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/artifactregistry.writer/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.service_accounts.google_project_iam_member.project-roles[2] has been changed
  ~ resource "google_project_iam_member" "project-roles" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/compute.instanceAdmin.v1/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # google_project_iam_member.project has been changed
  ~ resource "google_project_iam_member" "project" {
      ~ etag    = "BwW/TLBMA7s=" -> "BwXGD1kHuAc="
        id      = "two-eye-two-see/roles/artifactregistry.reader/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these
changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.container_repository will be destroyed
  - resource "google_artifact_registry_repository" "container_repository" {
      - create_time   = "2020-10-06T11:29:26.951602Z" -> null
      - format        = "DOCKER" -> null
      - id            = "projects/two-eye-two-see/locations/us-central1/repositories/" -> null
      - labels        = {} -> null
      - location      = "us-central1" -> null
      - name          = "low-touch-hubs" -> null
      - project       = "two-eye-two-see" -> null
      - repository_id = "low-touch-hubs" -> null
      - update_time   = "2020-10-06T11:29:26.951602Z" -> null
    }

  # google_artifact_registry_repository.registry will be created
  + resource "google_artifact_registry_repository" "registry" {
      + create_time   = (known after apply)
      + format        = "DOCKER"
      + id            = (known after apply)
      + location      = "us-central1"
      + name          = (known after apply)
      + project       = "pangeo-integration-te-3eea"
      + repository_id = "pangeo-hubs-registry"
      + update_time   = (known after apply)
    }

  # google_container_cluster.cluster will be created
  + resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = (known after apply)
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1-b"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "pangeo-hubs-cluster"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "pangeo-integration-te-3eea"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = true
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = true
            }

          + http_load_balancing {
              + disabled = true
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = "OPTIMIZE_UTILIZATION"
          + enabled             = false

          + auto_provisioning_defaults {
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)
          + password               = (sensitive value)
          + username               = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + network_policy {
          + enabled = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + ephemeral_storage_config {
                  + local_ssd_count = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)
            }
        }

      + release_channel {
          + channel = "UNSPECIFIED"
        }

      + workload_identity_config {
          + identity_namespace = "pangeo-integration-te-3eea.svc.id.goog"
        }
    }

  # google_container_node_pool.core will be created
  + resource "google_container_node_pool" "core" {
      + cluster             = "pangeo-hubs-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 1
      + instance_group_urls = (known after apply)
      + location            = "us-central1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "core-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "pangeo-integration-te-3eea"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 5
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "hub.jupyter.org/node-purpose" = "core"
              + "k8s.dask.org/node-purpose"    = "core"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-highmem-4"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # google_container_node_pool.dask_worker["worker"] will be created
  + resource "google_container_node_pool" "dask_worker" {
      + cluster             = "pangeo-hubs-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 0
      + instance_group_urls = (known after apply)
      + location            = "us-central1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "dask-worker"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "pangeo-integration-te-3eea"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 100
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = "pd-ssd"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "k8s.dask.org/node-purpose" = "worker"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-highmem-4"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "k8s.dask.org_dedicated"
                  + value  = "worker"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # google_container_node_pool.notebook["user"] will be created
  + resource "google_container_node_pool" "notebook" {
      + cluster             = "pangeo-hubs-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 0
      + instance_group_urls = (known after apply)
      + location            = "us-central1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "nb-user"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "pangeo-integration-te-3eea"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 20
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "hub.jupyter.org/node-purpose" = "user"
              + "k8s.dask.org/node-purpose"    = "scheduler"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-highmem-4"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "hub.jupyter.org_dedicated"
                  + value  = "user"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # google_project_iam_custom_role.identify_project_role will be created
  + resource "google_project_iam_custom_role" "identify_project_role" {
      + deleted     = (known after apply)
      + description = "Minimal role for hub users on pangeo-hubs to identify as current project"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "serviceusage.services.use",
        ]
      + project     = "pangeo-integration-te-3eea"
      + role_id     = "pangeo_hubs_user_sa_role"
      + stage       = "GA"
      + title       = "Identify as project role for users in pangeo-hubs"
    }

  # google_project_iam_member.cd_sa_roles["roles/artifactregistry.writer"] will be created
  + resource "google_project_iam_member" "cd_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = "roles/artifactregistry.writer"
    }

  # google_project_iam_member.cd_sa_roles["roles/container.admin"] will be created
  + resource "google_project_iam_member" "cd_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = "roles/container.admin"
    }

  # google_project_iam_member.cluster_sa_roles["roles/artifactregistry.reader"] will be created
  + resource "google_project_iam_member" "cluster_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = "roles/artifactregistry.reader"
    }

  # google_project_iam_member.cluster_sa_roles["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "cluster_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.cluster_sa_roles["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "cluster_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = "roles/monitoring.metricWriter"
    }

  # google_project_iam_member.cluster_sa_roles["roles/monitoring.viewer"] will be created
  + resource "google_project_iam_member" "cluster_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = "roles/monitoring.viewer"
    }

  # google_project_iam_member.cluster_sa_roles["roles/stackdriver.resourceMetadata.writer"] will be created
  + resource "google_project_iam_member" "cluster_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # google_project_iam_member.identify_project_binding will be created
  + resource "google_project_iam_member" "identify_project_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "pangeo-integration-te-3eea"
      + role    = (known after apply)
    }

  # google_project_iam_member.project will be destroyed
  - resource "google_project_iam_member" "project" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/artifactregistry.reader/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/artifactregistry.reader" -> null
    }

  # google_service_account.cd_sa will be created
  + resource "google_service_account" "cd_sa" {
      + account_id   = "pangeo-hubs-cd-sa"
      + display_name = "Continuous Deployment SA for pangeo-hubs"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "pangeo-integration-te-3eea"
      + unique_id    = (known after apply)
    }

  # google_service_account.cluster_sa will be created
  + resource "google_service_account" "cluster_sa" {
      + account_id   = "pangeo-hubs-cluster-sa"
      + display_name = "Cluster SA for pangeo-hubs"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "pangeo-integration-te-3eea"
      + unique_id    = (known after apply)
    }

  # google_service_account_key.cd_sa will be created
  + resource "google_service_account_key" "cd_sa" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_storage_bucket.user_buckets["pangeo-scratch"] will be created
  + resource "google_storage_bucket" "user_buckets" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "pangeo-hubs-pangeo-scratch"
      + project                     = "pangeo-integration-te-3eea"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_member.member["pangeo-scratch"] will be created
  + resource "google_storage_bucket_iam_member" "member" {
      + bucket = "pangeo-hubs-pangeo-scratch"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.gke.google_container_cluster.primary will be destroyed
  - resource "google_container_cluster" "primary" {
      - cluster_ipv4_cidr           = "10.72.0.0/14" -> null
      - default_max_pods_per_node   = 110 -> null
      - enable_binary_authorization = false -> null
      - enable_intranode_visibility = false -> null
      - enable_kubernetes_alpha     = false -> null
      - enable_legacy_abac          = false -> null
      - enable_shielded_nodes       = true -> null
      - enable_tpu                  = false -> null
      - endpoint                    = "199.223.234.241" -> null
      - id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster" -> null
      - initial_node_count          = 0 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-low-touch-hubs-c-dask-worker-pool-75041171-grp",
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-low-touch-hubs-cluster-user-pool-a058edeb-grp",
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-low-touch-hubs-cluster-core-pool-6000292e-grp",
        ] -> null
      - label_fingerprint           = "a9dc16a7" -> null
      - location                    = "us-central1-b" -> null
      - logging_service             = "logging.googleapis.com/kubernetes" -> null
      - master_version              = "1.19.9-gke.1900" -> null
      - min_master_version          = "1.19.9-gke.1400" -> null
      - monitoring_service          = "monitoring.googleapis.com/kubernetes" -> null
      - name                        = "low-touch-hubs-cluster" -> null
      - network                     = "projects/two-eye-two-see/global/networks/default" -> null
      - networking_mode             = "VPC_NATIVE" -> null
      - node_locations              = [] -> null
      - node_version                = "1.19.9-gke.1400" -> null
      - project                     = "two-eye-two-see" -> null
      - remove_default_node_pool    = true -> null
      - resource_labels             = {} -> null
      - self_link                   = "https://container.googleapis.com/v1beta1/projects/two-eye-two-see/zones/us-central1-b/clusters/low-touch-hubs-cluster" -> null
      - services_ipv4_cidr          = "10.76.0.0/20" -> null
      - subnetwork                  = "projects/two-eye-two-see/regions/us-central1/subnetworks/default" -> null

      - addons_config {

          - horizontal_pod_autoscaling {
              - disabled = true -> null
            }

          - http_load_balancing {
              - disabled = true -> null
            }

          - network_policy_config {
              - disabled = false -> null
            }
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - ip_allocation_policy {
          - cluster_ipv4_cidr_block       = "10.72.0.0/14" -> null
          - cluster_secondary_range_name  = "gke-low-touch-hubs-cluster-pods-6d95242f" -> null
          - services_ipv4_cidr_block      = "10.76.0.0/20" -> null
          - services_secondary_range_name = "gke-low-touch-hubs-cluster-services-6d95242f" -> null
        }

      - maintenance_policy {
          - daily_maintenance_window {
              - duration   = "PT4H0M0S" -> null
              - start_time = "05:00" -> null
            }
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURLekNDQWhPZ0F3SUJBZ0lSQUsxZmczeDZaT0t2YkdqTlNOSjV2TjB3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1kyUXlZbVZpT0RjdE5URXpaaTAwWlRWaUxXRXhaakF0TlRGbU1EVTFOekpsWWpVMQpNQjRYRFRJeE1ESXhPREE0TlRJek1Gb1hEVEkyTURJeE56QTVOVEl6TUZvd0x6RXRNQ3NHQTFVRUF4TWtZMlF5ClltVmlPRGN0TlRFelppMDBaVFZpTFdFeFpqQXROVEZtTURVMU56SmxZalUxTUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBeVlPOG9SbE4reWlmZ1FFRUU1U2kvTDQyeGcvcENMa2xuamR5NWdHawpVek9UM1hnbGM2TDk3ZGt3SVYzcDViQnR6SU1SZkgrZFIydUNTSnpmOXZNYk9IVTlQQkdmcjU4QUhXVmlmSE13CllRa0VMU3NubVVHdHpSb0ptSkdiRjNMTG53TXZ2MERsOHFEeko1enFvbjQ5TExETXo5Vm1RRWIrcDdDWDZyYUYKc3Z2U1RpK2swVDdXRHd4U1JGVFRZQmxSSTYyMWNhM3VQSU1xVk13cStwWGhXeTVXanltQ3k0MjRNeWVZbjV2QwpHMFIrcHFZOWszSjhpVm9DUUx1aVdFUS9EQmYxZGlPR09hYy8xSGxSN2F0SlNMQTdIL0lTRlNDYTN1SmJGeWdECmppcUFudU93dmxid3pORHB6VHNINDBicFlPaGMrQVNUZDEraSsyVzZRZERCYXdJREFRQUJvMEl3UURBT0JnTlYKSFE4QkFmOEVCQU1DQWdRd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZEJnTlZIUTRFRmdRVVJKTnhlU1YwVDVueAprcDJPZGo2UVZjdHZBRVV3RFFZSktvWklodmNOQVFFTEJRQURnZ0VCQUU3ODZncU8vNzR3d1FDK1N2bmhaUTIyCm5pVzl4VUdZMm9KNnZtVWo4NDQ1K245WERZS1JndzRBSDdoZ2VDOVZsN0xDTFJ2VkxYRHUybzkrZk9lRkt6ajcKeFd5dUgxcXZnTVFHZVF5dDl2Y1JVdXZJcU9KRkR4TVQ5alNtcER2MjdnRld1WXE3Ujh1a3RJcmZlZktmVFRvOQpCKytleCtPNjVIRElLZjRtd3RVWWxwK0xDTzBqTEdSNDVxdVMydlVEYSt4QkNWd0FBU0d2R1RJT2VFK2NKaUc5CmVOVzFqNWNNN05lbkFOU3Q2YXpmTEZCU1BYenpYdmlaRzdqOTlMSWx0S0RQZk5JNDZGeCs0WmRoQ0lOVGtmUjEKbkVyRDFOeGwwek5zQzFSNmYyQm5pVmIrVkFycGIrUDdrZk5PelUyTzlqOFdNdG1aWXFoU3UxbkFhc3Q0alZBPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - network_policy {
          - enabled  = true -> null
          - provider = "CALICO" -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-ssd" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS" -> null
          - labels            = {
              - "cluster_name"              = "low-touch-hubs-cluster"
              - "hub.jupyter.org/pool-name" = "dask-worker-pool"
              - "k8s.dask.org/node-purpose" = "worker"
              - "node_pool"                 = "dask-worker-pool"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-highmem-2" -> null
          - metadata          = {
              - "cluster_name"             = "low-touch-hubs-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "dask-worker-pool"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-low-touch-hubs-cluster",
              - "gke-low-touch-hubs-cluster-dask-worker-pool",
            ] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "k8s.dask.org_dedicated"
                  - value  = "worker"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - node_pool {
          - initial_node_count  = 0 -> null
          - instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-c-dask-worker-pool-75041171-grp",
            ] -> null
          - max_pods_per_node   = 110 -> null
          - name                = "dask-worker-pool" -> null
          - node_count          = 0 -> null
          - node_locations      = [
              - "us-central1-b",
            ] -> null
          - version             = "1.19.9-gke.1400" -> null

          - autoscaling {
              - max_node_count = 10 -> null
              - min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-ssd" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS" -> null
              - labels            = {
                  - "cluster_name"              = "low-touch-hubs-cluster"
                  - "hub.jupyter.org/pool-name" = "dask-worker-pool"
                  - "k8s.dask.org/node-purpose" = "worker"
                  - "node_pool"                 = "dask-worker-pool"
                } -> null
              - local_ssd_count   = 0 -> null
              - machine_type      = "e2-highmem-2" -> null
              - metadata          = {
                  - "cluster_name"             = "low-touch-hubs-cluster"
                  - "disable-legacy-endpoints" = "true"
                  - "node_pool"                = "dask-worker-pool"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - service_account   = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
              - tags              = [
                  - "gke-low-touch-hubs-cluster",
                  - "gke-low-touch-hubs-cluster-dask-worker-pool",
                ] -> null
              - taint             = [
                  - {
                      - effect = "NO_SCHEDULE"
                      - key    = "k8s.dask.org_dedicated"
                      - value  = "worker"
                    },
                ] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - node_metadata = "GKE_METADATA_SERVER" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
            }
        }
      - node_pool {
          - initial_node_count  = 0 -> null
          - instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-user-pool-a058edeb-grp",
            ] -> null
          - max_pods_per_node   = 110 -> null
          - name                = "user-pool" -> null
          - node_count          = 0 -> null
          - node_locations      = [
              - "us-central1-b",
            ] -> null
          - version             = "1.19.9-gke.1400" -> null

          - autoscaling {
              - max_node_count = 10 -> null
              - min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-ssd" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS" -> null
              - labels            = {
                  - "cluster_name"                 = "low-touch-hubs-cluster"
                  - "hub.jupyter.org/node-purpose" = "user"
                  - "hub.jupyter.org/pool-name"    = "user-pool"
                  - "k8s.dask.org/node-purpose"    = "scheduler"
                  - "node_pool"                    = "user-pool"
                } -> null
              - local_ssd_count   = 0 -> null
              - machine_type      = "n1-standard-4" -> null
              - metadata          = {
                  - "cluster_name"             = "low-touch-hubs-cluster"
                  - "disable-legacy-endpoints" = "true"
                  - "node_pool"                = "user-pool"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = false -> null
              - service_account   = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
              - tags              = [
                  - "gke-low-touch-hubs-cluster",
                  - "gke-low-touch-hubs-cluster-user-pool",
                ] -> null
              - taint             = [
                  - {
                      - effect = "NO_SCHEDULE"
                      - key    = "hub.jupyter.org_dedicated"
                      - value  = "user"
                    },
                ] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - node_metadata = "GKE_METADATA_SERVER" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
            }
        }
      - node_pool {
          - initial_node_count  = 0 -> null
          - instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-core-pool-6000292e-grp",
            ] -> null
          - max_pods_per_node   = 110 -> null
          - name                = "core-pool" -> null
          - node_count          = 0 -> null
          - node_locations      = [
              - "us-central1-b",
            ] -> null
          - version             = "1.19.9-gke.1400" -> null

          - autoscaling {
              - max_node_count = 5 -> null
              - min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = false -> null
            }

          - node_config {
              - disk_size_gb      = 50 -> null
              - disk_type         = "pd-standard" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS" -> null
              - labels            = {
                  - "cluster_name"                 = "low-touch-hubs-cluster"
                  - "default-node-pool"            = "true"
                  - "hub.jupyter.org/node-purpose" = "core"
                  - "hub.jupyter.org/pool-name"    = "core-pool"
                  - "k8s.dask.org/node-purpose"    = "core"
                  - "node_pool"                    = "core-pool"
                } -> null
              - local_ssd_count   = 0 -> null
              - machine_type      = "n1-highmem-4" -> null
              - metadata          = {
                  - "cluster_name"             = "low-touch-hubs-cluster"
                  - "disable-legacy-endpoints" = "true"
                  - "node_pool"                = "core-pool"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = false -> null
              - service_account   = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
              - tags              = [
                  - "gke-low-touch-hubs-cluster",
                  - "gke-low-touch-hubs-cluster-core-pool",
                ] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - node_metadata = "GKE_METADATA_SERVER" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
            }
        }

      - release_channel {
          - channel = "UNSPECIFIED" -> null
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - vertical_pod_autoscaling {
          - enabled = false -> null
        }

      - workload_identity_config {
          - identity_namespace = "two-eye-two-see.svc.id.goog" -> null
        }
    }

  # module.gke.google_container_node_pool.pools["core-pool"] will be destroyed
  - resource "google_container_node_pool" "pools" {
      - cluster             = "low-touch-hubs-cluster" -> null
      - id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/core-pool" -> null
      - initial_node_count  = 0 -> null
      - instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-core-pool-6000292e-grp",
        ] -> null
      - location            = "us-central1-b" -> null
      - max_pods_per_node   = 110 -> null
      - name                = "core-pool" -> null
      - node_count          = 0 -> null
      - node_locations      = [
          - "us-central1-b",
        ] -> null
      - project             = "two-eye-two-see" -> null
      - version             = "1.19.9-gke.1400" -> null

      - autoscaling {
          - max_node_count = 5 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - node_config {
          - disk_size_gb      = 50 -> null
          - disk_type         = "pd-standard" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS" -> null
          - labels            = {
              - "cluster_name"                 = "low-touch-hubs-cluster"
              - "default-node-pool"            = "true"
              - "hub.jupyter.org/node-purpose" = "core"
              - "hub.jupyter.org/pool-name"    = "core-pool"
              - "k8s.dask.org/node-purpose"    = "core"
              - "node_pool"                    = "core-pool"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n1-highmem-4" -> null
          - metadata          = {
              - "cluster_name"             = "low-touch-hubs-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "core-pool"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = false -> null
          - service_account   = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-low-touch-hubs-cluster",
              - "gke-low-touch-hubs-cluster-core-pool",
            ] -> null
          - taint             = [] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool"] will be destroyed
  - resource "google_container_node_pool" "pools" {
      - cluster             = "low-touch-hubs-cluster" -> null
      - id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/dask-worker-pool" -> null
      - initial_node_count  = 0 -> null
      - instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-c-dask-worker-pool-75041171-grp",
        ] -> null
      - location            = "us-central1-b" -> null
      - max_pods_per_node   = 110 -> null
      - name                = "dask-worker-pool" -> null
      - node_count          = 0 -> null
      - node_locations      = [
          - "us-central1-b",
        ] -> null
      - project             = "two-eye-two-see" -> null
      - version             = "1.19.9-gke.1400" -> null

      - autoscaling {
          - max_node_count = 10 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-ssd" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS" -> null
          - labels            = {
              - "cluster_name"              = "low-touch-hubs-cluster"
              - "hub.jupyter.org/pool-name" = "dask-worker-pool"
              - "k8s.dask.org/node-purpose" = "worker"
              - "node_pool"                 = "dask-worker-pool"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-highmem-2" -> null
          - metadata          = {
              - "cluster_name"             = "low-touch-hubs-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "dask-worker-pool"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-low-touch-hubs-cluster",
              - "gke-low-touch-hubs-cluster-dask-worker-pool",
            ] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "k8s.dask.org_dedicated"
                  - value  = "worker"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

  # module.gke.google_container_node_pool.pools["user-pool"] will be destroyed
  - resource "google_container_node_pool" "pools" {
      - cluster             = "low-touch-hubs-cluster" -> null
      - id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/user-pool" -> null
      - initial_node_count  = 0 -> null
      - instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-user-pool-a058edeb-grp",
        ] -> null
      - location            = "us-central1-b" -> null
      - max_pods_per_node   = 110 -> null
      - name                = "user-pool" -> null
      - node_count          = 0 -> null
      - node_locations      = [
          - "us-central1-b",
        ] -> null
      - project             = "two-eye-two-see" -> null
      - version             = "1.19.9-gke.1400" -> null

      - autoscaling {
          - max_node_count = 10 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-ssd" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS" -> null
          - labels            = {
              - "cluster_name"                 = "low-touch-hubs-cluster"
              - "hub.jupyter.org/node-purpose" = "user"
              - "hub.jupyter.org/pool-name"    = "user-pool"
              - "k8s.dask.org/node-purpose"    = "scheduler"
              - "node_pool"                    = "user-pool"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n1-standard-4" -> null
          - metadata          = {
              - "cluster_name"             = "low-touch-hubs-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "user-pool"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = false -> null
          - service_account   = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-low-touch-hubs-cluster",
              - "gke-low-touch-hubs-cluster-user-pool",
            ] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "hub.jupyter.org_dedicated"
                  - value  = "user"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

  # module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be destroyed
  - resource "google_project_iam_member" "cluster_service_account-log_writer" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/logging.logWriter/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/logging.logWriter" -> null
    }

  # module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be destroyed
  - resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/monitoring.metricWriter/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/monitoring.metricWriter" -> null
    }

  # module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be destroyed
  - resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/monitoring.viewer/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/monitoring.viewer" -> null
    }

  # module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be destroyed
  - resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/stackdriver.resourceMetadata.writer" -> null
    }

  # module.gke.google_service_account.cluster_service_account[0] will be destroyed
  - resource "google_service_account" "cluster_service_account" {
      - account_id   = "tf-gke-low-touch-hubs--owc3" -> null
      - display_name = "Terraform-managed service account for cluster low-touch-hubs-cluster" -> null
      - email        = "tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - id           = "projects/two-eye-two-see/serviceAccounts/tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - name         = "projects/two-eye-two-see/serviceAccounts/tf-gke-low-touch-hubs--owc3@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project      = "two-eye-two-see" -> null
      - unique_id    = "102172618335606460881" -> null
    }

  # module.gke.random_shuffle.available_zones will be destroyed
  - resource "random_shuffle" "available_zones" {
      - id           = "-" -> null
      - input        = [
          - "us-central1-a",
          - "us-central1-b",
          - "us-central1-c",
          - "us-central1-f",
        ] -> null
      - result       = [
          - "us-central1-c",
          - "us-central1-b",
          - "us-central1-f",
        ] -> null
      - result_count = 3 -> null
    }

  # module.gke.random_string.cluster_service_account_suffix will be destroyed
  - resource "random_string" "cluster_service_account_suffix" {
      - id          = "owc3" -> null
      - length      = 4 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = "owc3" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.service_accounts.google_project_iam_member.project-roles[0] will be destroyed
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/container.admin/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/container.admin" -> null
    }

  # module.service_accounts.google_project_iam_member.project-roles[1] will be destroyed
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/artifactregistry.writer/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/artifactregistry.writer" -> null
    }

  # module.service_accounts.google_project_iam_member.project-roles[2] will be destroyed
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwXGD1kHuAc=" -> null
      - id      = "two-eye-two-see/roles/compute.instanceAdmin.v1/serviceaccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project = "two-eye-two-see" -> null
      - role    = "roles/compute.instanceAdmin.v1" -> null
    }

  # module.service_accounts.google_service_account.service_accounts[0] will be destroyed
  - resource "google_service_account" "service_accounts" {
      - account_id   = "low-touch-hubs-cd-sa" -> null
      - display_name = "Terraform-managed service account" -> null
      - email        = "low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - id           = "projects/two-eye-two-see/serviceAccounts/low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - name         = "projects/two-eye-two-see/serviceAccounts/low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - project      = "two-eye-two-see" -> null
      - unique_id    = "112568000850805183957" -> null
    }

  # module.service_accounts.google_service_account_key.keys[0] will be destroyed
  - resource "google_service_account_key" "keys" {
      - id                 = "projects/two-eye-two-see/serviceAccounts/low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com/keys/107710688b17ce563c639416dbc445ee4998ae53" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/two-eye-two-see/serviceAccounts/low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com/keys/107710688b17ce563c639416dbc445ee4998ae53" -> null
      - private_key        = (sensitive value)
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJY3pYaWQ3aWlNbEV3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1URXlOVFk0TURBd09EVXdPREExTVRnek9UVTNNQ0FYRFRJd01Ea3lPVEE1TURZeE1Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1USTFOamd3TURBNE5UQTRNRFV4T0RNNU5UY3dnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ3lWb0N2YXFpU0N2c1p4bjlQOHJJU0I1OU0KOXhhVWhKT3F2bHU3cmUyOHpIK2lWU0NVNkZkclRvNDR4dUFkWUVGd2VRZ2N2SThETWNBeVRXTURkZnFRZ1hWVApLbkR0WGo2dHovSTVGUmhwcVZBeWxxWXo0bklzWUcxVFhlV3BUdEU0V21VKytjcG5NQm5laXZ0QjhQWEd5ampECnF0NUlqeHVMaE9XQjd0UWxJczhBKzcvN1JRZFhUQkx0bDJhYTkyRVQ2REtiMlV5RDh2dGFxSnJOaVZFSjl1eS8KTkM0b2JFU3NSZFZ4ZzFOL0NmcnFuMzRqSk1VZ1p2R0hLYUJodEtLSklFOUZRWTh5dzJkWUdEUGQ2L3c2MUdIeQppQ29jQzhYcUJHUytZRWpodFQ3WlJlRWpQWU1oekZoN2YyNkRHM28rS1ptZDR4VTJTNm9VdEhYaDNBVkRBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ1k5SEtGSC9vTS9tbHl6WGRpR3JnbApEK3Z4RnlwOEsrcmxPLzlZVTlSY1BESmxianFqQzdWVW5DMytkZERZS29ZcDRCU2ExdENzT2VOUVM0VFRoeXZZClg5U2VCT01DdVZxQUxnc3M2cVNaQVBJTm5Tai9aNFczVU5jeEdFVnZ4WkRiVkVEc2k0MnhEM3Q5elZiclpxa0kKaTI5bSt6ZVR2aUJQU1AySmM2ajJrUXYzcFozQWoxc25NR0pGSmxVSWdKOFFPRFo3czh3VUM3K2gzU0pmMzg4MQpiMzNJd2lKLzBvVUFhUjRZRmRjdlJ5Y29LMERVcmd5a2gwTzVWK2Z2YW80R0lOUDl1cUVhY1JuUDdMRHFCZXowCmJISkpIeWZRREdES2ozVW1HOHpuc2dIRDNRQ0dmQnlBRTFRT1QzaVV4SVdGRDg1OVJNeTFiU3hHdm5qTDQvc0oKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "low-touch-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com" -> null
      - valid_after        = "2020-09-29T09:06:10Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be destroyed
  - resource "null_resource" "module_depends_on" {
      - id       = "8865553039709359568" -> null
      - triggers = {
          - "value" = "5"
        } -> null
    }

Plan: 19 to add, 0 to change, 19 to destroy.

Changes to Outputs:
  ~ ci_deployer_key = (sensitive value)
```
</details>

I also don't think I can deploy manually. I need to be signed into my 2i2c.org account to access the state in the storage bucket in `two-eye-two-see-org`, but I won't be able to deploy to the pangeo project with those corrections 😕 